{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Part of my research examines Black identity formation in Greece. I focus on how Afro-descendants in present-day Greece demonstrate resistance to the dominant narrative of belonging and express their dual heritage through artistic mediums that illuminate their presence in the country and their rich contributions to the art scene. As a member of the Afro-Greek community affiliated with the collective Døcumatism, which runs the project the AfroGreeks, I use my expertise to analyse the audiovisual material selected for the purposes of this project, and I aspire that viewers will gain a deeper understanding of the presence of the Black Diaspora in Greece. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Various terms exist to articulate the ways that Black Studies and digital studies intersect, as well as myriad ways to refer to related fields of study, such as digital diaspora studies, which is an emergent interdisciplinary field that explores the complex interplay between technology, migration, communication, arts, and identity within diasporic communities (Josephs & Risam, 2021). While communities in the diaspora are in the process of forming and reshaping their identities, they create new narratives of belonging and are also experimenting with the digital landscape, engaging in practices that challenge the dynamics of belonging (Heyd 2016). The use of multi-media is also used to contribute to the circulation of knowledge that has been ignored in mainstream space,s but is used creatively to raise awareness and give visibility to underrepresented communities."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "As a member of the collective Døcumatism, exploring the rich history of the Mediterranean made me realise that Afro-descendants are discovering their past and redefining their identity. Døcumatism uses art and films featuring real-life heroes in order to challenge stereotypes, explore solutions to societal challenges, and empower marginalised groups. Among the collective’s most impactful initiatives is the AfroGreeks, an ongoing collective community project that includes video installations, interviews, concerts, workshops, screenings, and an archive-laboratory that keeps expanding. This project connects the members of the African diaspora in Greece and collaborates with them, creating meeting opportunities for individuals to work together and simultaneously, through recorded events and action,s build an extensive audiovisual archive. The archive being developed started off as an artistic initiative that evolved into a collective community project documenting the movement of Afro-Greek visibility and representation, being the very first attempt made to capture audio-visual the history of the African Diaspora in Greece in the 21st century, tracing its roots/routes back four centuries. Using art as a tool to create public debates and social interactions, the local Black community builds connections with Black diasporic communities across Europe, advocating for the legacy of Black presence in Europe, promoting cultural exchange, which also reinforces the movement in Greece in support of the argument that the history of the Black diaspora in Greece undeniably has a place in Greek national history."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Using the AfroGreeks as a case study, I elaborate on how the Black community in Greece uses creative methods to introduce social issues that are relevant to Afrodiasporic communities globall,y while the project continues to evolve, traveling across Europe through exhibitions, public programs, collaborations, discussions, publications, and live events.  "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "An important milestone of the project has been the celebration of Black History Month (BHM) in 2021. A public action born from my personal aspiration to celebrate Black History Month in Greece in May, the month when the citizenship law for 2nd generation was set for public consultation before being passed in the parliament in 2015, was brought to life through the creation of the first multimedia radio show. The preparation of the initiative happened in collaboration with the Anasa Cultural Center of African Arts, and the execution was broadcast live, allowing the audience to witness the creative process of this radio show in real time. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "In 2024, BHM was celebrated again in the form of a musical performance dedicated to the African American writer, essayist, playwright, and activist James Baldwin, on the occasion of the 101st anniversary of his birth. The concert was co-created by the project the AfroGreeks and Afro-Greek artists in the form of a musical dialogue, highlighting how artistic Black expression truly transcends borders. In James Baldwin's work, it is evident that music reveals a lot about history in our time, and African American music was performed at the event as a bridge to acknowledge our distinct but shared histories."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "This project includes the annotation of three videos. The recorded clip of the BHM event in 2024, as well as a trailer extracted from the very first short movie created in the project,the AfroGreeks. Lastly, I will also be annotating a shorter clip that was created in the form of a trailer to introduce the events that took place in 2021, on the International Day of the Elimination of Racial Discrimination, which was also World Poetry Day. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Works Cited"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Heyd, T. (2016). “Narratives of Belonging in the Digital Diaspora: Corpus Approaches to a Cultural Concept.” Open Linguistics 2:1, 287-299."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Josephs, K. B., & Risam, R. (Eds.). (2021). The digital Black Atlantic / Roopika Risam and Kelly Baker Josephs, editors. University of Minnesota Press. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Kanneh, Kadiatu (1998). African Identities: Race, Nation, and Culture in Ethnography, Pan-Africanism, and Black Literatures"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    }
  ],
  "title": "Introduction ",
  "autogenerate": {
    "enabled": false,
    "type": "custom"
  },
  "slug": "introduction",
  "created_at": "2025-12-17T05:22:13.778Z",
  "created_by": "Grace-137",
  "updated_at": "2025-12-17T05:22:13.778Z",
  "updated_by": "Grace-137"
}